In [14]:
import pandas as pd

In [8]:
pd.read_excel(r'C:\Users\Priyanka\Desktop\Dataset1.xlsx')

    Name     Batch  Roll No.    Address
0  Allen  Python03         1       Pune
1    bob   java002         2      Noida
2   Ajay  Python03        67  Bengaluru

In [12]:
pd.read_csv(r'C:\Users\Priyanka\Desktop\Dataset2.csv')

     Name     Batch  Roll No.    Address
0   Allen  Python03         1       Pune
1     bob   java002         2      Noida
2    Ajay  Python03        67  Bengaluru
3    Alex   java002        23      delhi
4  roshan  Python03        66     mumbai
5    alex   java002        77     dispur

In [22]:
pd.read_csv(r'C:\Users\Priyanka\Desktop\Dataset3.tsv',sep='\t')

    Name  PhoneNumber  batchNo.
0  Allen   8787833399  python001
1   alex   7898983456    java009
2  aditi   6478934098  python001
3  rahul   6789003308    java009